<a href="https://colab.research.google.com/github/hewp84/CRT420/blob/main/Pandas_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PANDAS: Merge, Concatenate, and Join

## Concatenate

The `concat` method in pandas is used to concatenate (combine) pandas objects like Series and DataFrames along a particular axis (either rows or columns). It is particularly useful when you have multiple data sources and you want to combine them into a single DataFrame.

Properties of the concat method:

* Concatenation can be done along either the rows (axis 0) or columns (axis 1).
* It can handle concatenating multiple DataFrames at once.
* It can handle both inner and outer joins.

In [ ]:
pandas.concat(objs, axis=0, join='outer', ignore_index=False)

#### Attributes:

* objs: A sequence of pandas objects (e.g., DataFrames or Series) that you want to concatenate.
* axis: The axis along which the concatenation will be performed (0 for rows, 1 for columns).
* join: Type of join to be performed ('inner', 'outer', 'left', 'right').
* ignore_index: If True, the resulting DataFrame will have a new index; if False (default), indexes from the original objects will be preserved.

#### Key Parameters:

* objs: A sequence of pandas objects to concatenate.
* axis: Determines whether to concatenate along rows (0) or columns (1).
* join: Specifies the type of join to perform, which could be 'inner', 'outer', 'left', or 'right'.
* ignore_index: If set to True, the resulting DataFrame will have a new index.

Examples:

Let's consider two dictionaries representing DataFrames as examples:

In [66]:
import pandas as pd

data1 = {'A': [1, 2, 3],
         'B': [4, 5, 6],
         'C': [7, 8, 9],
         'D': [10, 11, 12]}

data2 = {'A': [13, 14, 15],
         'B': [16, 17, 18],
         'C': [19, 20, 21],
         'D': [22, 23, 24],
        'E': [25,26,27]}
         
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [52]:
df2

    A   B   C   D
0  13  16  19  22
1  14  17  20  23
2  15  18  21  24

Example 1: Concatenating along rows (axis=0) with the same columns:

In [61]:
result = pd.concat([df1, df2])
result

    A   B   C   D     E
0   1   4   7  10   NaN
1   2   5   8  11   NaN
2   3   6   9  12   NaN
0  13  16  19  22  25.0
1  14  17  20  23  26.0
2  15  18  21  24  27.0

Example 2: Concatenating along columns (axis=1):

In [62]:
result1 = pd.concat([df1, df2], axis=1)
result1

   A  B  C   D   A   B   C   D   E
0  1  4  7  10  13  16  19  22  25
1  2  5  8  11  14  17  20  23  26
2  3  6  9  12  15  18  21  24  27

Example 3: Ignoring original indices and resetting index:

In [65]:
result2 = pd.concat([df1, df2], ignore_index=True)
result2

    A   B   C   D     E
0   1   4   7  10   NaN
1   2   5   8  11   NaN
2   3   6   9  12   NaN
3  13  16  19  22  25.0
4  14  17  20  23  26.0
5  15  18  21  24  27.0

Example 4: Performing different joins:

In [70]:
result3 = pd.concat([df1, df2], join='inner')
result3

    A   B   C   D
0   1   4   7  10
1   2   5   8  11
2   3   6   9  12
0  13  16  19  22
1  14  17  20  23
2  15  18  21  24

## Merge method

The merge method in pandas is used to combine two or more DataFrames based on common columns or indexes. It's similar to joining tables in SQL. The method performs database-style joins, allowing you to combine datasets using various types of joins.

#### Properties of the merge method:

* Merging can be performed on one or more columns, and it's based on common values.
* Different types of joins like inner, outer, left, and right can be used.
* The merge method allows you to handle duplicate columns that might arise from merging.

#### Syntax:

In [ ]:
pandas.merge(left, right, on=None, how='inner',)

Attributes:

* left: The left DataFrame to be merged.
* right: The right DataFrame to be merged.
* on: The column(s) or index(es) to merge on.
* how: The type of join to perform ('inner', 'outer', 'left', 'right').

Examples:

In [95]:
import pandas as pd

data1 = {'ID': [1, 2, 3, 4],
         'Name': ['Alice', 'Bob', 'Charlie', 'David']}

data2 = {'ID': [3, 4, 5, 6],
         'Age': [25, 32, 28, 40]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [74]:
df2

   ID  Age
0   3   25
1   4   32
2   5   28
3   6   40

In [78]:
# Example 1: Different Joins on a Common Column:

result_join = pd.merge(df1, df2, on='ID', how='right')
result_join

   ID     Name  Age
0   3  Charlie   25
1   4    David   32
2   5      NaN   28
3   6      NaN   40

In [87]:
#Example 2
data3 = {'EmpID': [2, 3, 4, 7],
         'Salary': [60000, 75000, 80000, 50000]}

df3 = pd.DataFrame(data3)

result_left = pd.merge(df1, df3, left_on='ID', right_on='EmpID', how='outer')
result_left

      Name  EmpID   Salary
0    Alice    NaN      NaN
1      Bob    2.0  60000.0
2  Charlie    3.0  75000.0
3    David    4.0  80000.0
4      NaN    7.0  50000.0

In [96]:
# Example 3
df1 = df1.set_index('ID')
df2 = df2.set_index('ID')

result_outer = pd.merge(df1, df2, left_index=True, right_index=True, how='inner')
result_outer

       Name  Age
ID
3   Charlie   25
4     David   32

In [97]:
#Example 4
data4 = {'ID': [1, 2, 3, 4],
         'Name': ['Eve', 'Frank', 'Grace', 'Henry']}

df4 = pd.DataFrame(data4)

result_suffix = pd.merge(df1, df4, on='ID', how='inner', suffixes=('_left', '_right'))
result_suffix

   ID Name_left Name_right
0   1     Alice        Eve
1   2       Bob      Frank
2   3   Charlie      Grace
3   4     David      Henry

## Join Method

The join() method allows you to join DataFrames together based on an index or column in each DataFrame. It is different from concat() in that it uses the indexes/columns rather than just concatenating. It is different from merge() in that you must specify the index/column to join on rather than merge() allowing specification of multiple join keys.

#### Properties:

* Joins DataFrames together based on specified index or column names
* Result will contain union of indexes/columns from both DataFrames
* Can specify how='left', 'right', 'outer' to control join behavior
* Preserves indexes/columns not used in the join

#### Syntax:

In [ ]:
df1.join(df2, how='left', on=None, lsuffix='', rsuffix='')

Examples:

In [98]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]}, index=[1, 2])
df2 = pd.DataFrame({'C': [5, 6]}, index=[1, 2])

df1

   A  B
1  1  3
2  2  4

In [99]:
df2

   C
1  5
2  6

In [102]:
df1.join(df2)

   A  B  C
1  1  3  5
2  2  4  6

In [103]:
df1

   A  B
1  1  3
2  2  4

### Additional examples using World data set

In [110]:
data = pd.read_csv('world-data-2023.csv')
df1 = data[['Country', 'Population']].head(3)
df2 = data[['Country','Birth Rate']].head(3)

df3 = pd.concat([df1, df2], axis=1)
df3

       Country  Population      Country  Birth Rate
0  Afghanistan  38,041,754  Afghanistan       32.49
1      Albania   2,854,191      Albania       11.78
2      Algeria  43,053,054      Algeria       24.28

In [121]:
df3 = data[['Country','Population']].head(3)
df4 = data[['Country','Birth Rate']].head(5)

pd.merge(df3, df4, on='Country', how='right')

       Country  Population  Birth Rate
0  Afghanistan  38,041,754       32.49
1      Albania   2,854,191       11.78
2      Algeria  43,053,054       24.28
3      Andorra         NaN        7.20
4       Angola         NaN       40.73

In [118]:
# Set index to Country and select Population column
df1 = data[['Country', 'Population']].head(3)
df2 = data[['Birth Rate']].head(3)

# Join on index 
#df1.join(df2, how='left', on=None, lsuffix='', rsuffix='')
df1.join(df2)

       Country  Population  Birth Rate
0  Afghanistan  38,041,754       32.49
1      Albania   2,854,191       11.78
2      Algeria  43,053,054       24.28